In [1]:
import pandas as pd

In [2]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['London', 'New York', 'Paris', 'Tokyo', 'Sydney'],
    'Salary': [60000, 75000, 80000, 70000, 65000]
}

In [3]:
employees = pd.DataFrame(data)

In [7]:
last_two_rows = employees.index[-2:]
employees.loc[last_two_rows, ["Name", "Salary"]]

    Name  Salary
3  David   70000
4   Emma   65000

In [11]:
employees.iloc[-2:, [0, 3]]

    Name  Salary
3  David   70000
4   Emma   65000

In [18]:
employees.loc[0:2][employees["Age"] >= 30]

/var/folders/jh/3nbfxwtd1qbgbrmmlx8_4wqc0000gn/T/ipykernel_16278/1924261397.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  employees.loc[0:2][employees["Age"] >= 30]

      Name  Age      City  Salary
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000